{
    "What is your name?": "I am your friendly chatbot here to help you!",
    "How are you?": "I'm just a bunch of code, but I’m here to chat with you!",
    "What can you do?": "I can chat with you, tell you stories, or even help answer simple questions.",
    "Tell me a joke": "Why don't scientists trust atoms? Because they make up everything!",
    "What's the weather like?": "I can't check the weather right now, but I hope it's sunny and nice!",
    "What is it like in a Primary School?": "Primary school is a new place where you will learn new things, make new friends, and have fun! It is like kindergarten, but with a few more adventures and a bit more learning.",
    "Will I have friends there?": "Yes, you will meet many new children who are just as excited as you are! You can play with them and learn together. Your teacher will help you make new friends too.",
    "Will I have the same teacher?": "You will have a new teacher who is really nice and loves helping children learn new things. Your new teacher will make sure you feel happy and safe.",
    "What if I don’t know where to go?": "That is okay! Your new teacher and other friendly grown ups at school will show you around. You will learn where your classroom, lunchroom, and playground are in no time!",
    "Will my mom or dad stay with me?": "Your mom or dad will drop you off and pick you up after school. But during the day, you will be with your teacher and new friends. It is like a big adventure, and you can tell them all about it when you get home!",
    "What will I learn?": "You will learn fun things like reading, counting, art, and even exploring nature. You might hear new stories, sing new songs, and try exciting activities.",
    "What if I miss my kindergarten friends?": "Your teacher is there to help you with anything you need, whether it is finding your classroom, learning something new, or feeling a little nervous.",
    "Do I have to wear a uniform?": "Some schools have uniforms, and others do not. Your teacher or parents will let you know. And if you do, you can think of it like a special outfit for school days!",
    "Can I bring my toys?": "In primary school, there will be new toys and games in your classroom to play with. You’ll have plenty of fun things to do there, so you won’t need to bring your own toys.",
    "What subjects are there in primary school?": "You will learn subjects like English, Mathematics, Mother Tongue, Physical Education, Art and Music. It will be very fun!",
    "Will there be time to play?": "Yes, there will be plenty of time to play during recess! It’s a special time when you can play games, have snacks, and chat with your friends.",
    "How will I carry my heavy school bag?": "Carrying a bag might feel new at first, but with practice, it gets easier. You can organize your things so it feels lighter, and don’t be afraid to ask for help if you need it!",
    ""What if I don’t understand what the teacher says?": "It’s perfectly fine not to understand everything right away. If you’re unsure, you can raise your hand and ask your teacher to explain. They’re happy to help, and other children might have the same question too!"
}
