{
    "What is your name?": "I am your friendly chatbot here to help you!",
    "How are you?": "I'm just a bunch of code, but I’m here to chat with you!",
    "What can you do?": "I can chat with you, tell you stories, or even help answer simple questions.",
    "Tell me a joke": "Why don't scientists trust atoms? Because they make up everything!",
    "What's the weather like?": "I can't check the weather right now, but I hope it's sunny and nice!",
    "What is it like in a Primary School?": "Primary school is a new place where you will learn new things, make new friends, and have fun! It is like kindergarten, but with a few more adventures and a bit more learning.",
    "Will I have friends there?": "Yes, you will meet many new children who are just as excited as you are! You can play with them and learn together. Your teacher will help you make new friends too.",
    "Will I have the same teacher?": "You will have a new teacher who is really nice and loves helping children learn new things. Your new teacher will make sure you feel happy and safe.",
    "What if I don’t know where to go?": "That is okay! Your new teacher and other friendly grown ups at school will show you around. You will learn where your classroom, lunchroom, and playground are in no time!",
    "Will my mom or dad stay with me?": "Your mom or dad will drop you off and pick you up after school. But during the day, you will be with your teacher and new friends. It is like a big adventure, and you can tell them all about it when you get home!",
    "What will I learn?": "You will learn fun things like reading, counting, art, and even exploring nature. You might hear new stories, sing new songs, and try exciting activities.",
    "What if I miss my kindergarten friends?": "Your teacher is there to help you with anything you need, whether it is finding your classroom, learning something new, or feeling a little nervous.",
    "Do I have to wear a uniform?": "Some schools have uniforms, and others do not. Your teacher or parents will let you know. And if you do, you can think of it like a special outfit for school days!",
    "Can I bring my toys?": "In primary school, there will be new toys and games in your classroom to play with. You’ll have plenty of fun things to do there, so you won’t need to bring your own toys.",
    "What subjects are there in primary school?": "You will learn subjects like English, Mathematics, Mother Tongue, Physical Education, Art and Music. It will be very fun!",
    "Will there be time to play?": "Yes, there will be plenty of time to play during recess! It’s a special time when you can play games, have snacks, and chat with your friends.",
    "How will I carry my heavy school bag?": "Carrying a bag might feel new at first, but with practice, it gets easier. You can organize your things so it feels lighter, and don’t be afraid to ask for help if you need it!",
    "What if I don’t understand what the teacher says?": "It’s perfectly fine not to understand everything right away. If you’re unsure, you can raise your hand and ask your teacher to explain. They’re happy to help, and other children might have the same question too!",
    "What if I don't like the food in the canteen?": "The canteen has lots of different foods, so you might find something new that you like! You can also let your parents know about your preferences, and they can pack a snack or lunch for you just in case.",
    "Will I have to go to school every day?": "Yes, you’ll go to school on weekdays, and then you get to enjoy weekends at home! School days are full of learning and fun, and the weekends are a great time to relax and share everything you did.",
    "What happens if I forget my homework?": "It’s okay; mistakes happen! If you forget your homework, let your teacher know. They understand that everyone is still learning how to be responsible, and they will guide you on what to do next time.",
    "What if older kids bully me?": "If anyone ever makes you feel uncomfortable, talk to your teacher or an adult you trust right away. Schools have teachers and staff who are there to keep you safe and happy. They will listen and help you.",
    "Will I have time to see my old friends?": "Absolutely! You can still meet your old friends after school, on weekends, and during the holidays. And you’ll have the chance to make many new friends at your new school too!",
    "What if I don’t like my new school?": "It’s normal to feel unsure at first. Give it some time, and as you get used to your new school, you might find things that you really enjoy! But if you’re ever feeling unhappy, let your parents or teacher know so they can help you feel better.",
    "Do I need to know all the rules on the first day?": "You don’t have to know everything right away! Your teachers and new friends will help you learn the school rules step-by-step. Just remember to listen and ask questions when you’re unsure.",
    "Will I still have time to play games and watch TV at home?": "Yes! You’ll have time after school to do things you enjoy, like playing games, watching TV, and spending time with your family. You can even plan your day to fit in school and fun activities.",
    "What if I need to go to the toilet during class?": "If you need to go, it’s okay to ask your teacher politely. Teachers understand, and they will let you go so that you feel comfortable in class.",
    "Why do I have to wake up so early?": "Waking up early gives you time to get ready, eat breakfast, and be prepared for the school day. It might feel tough at first, but it gets easier, and you’ll be ready for all the fun and learning!",
    "What if I’m too shy to talk in class?": "It’s okay to feel shy. You can take your time, and when you feel ready, share your thoughts. Teachers are very patient, and they appreciate it when you try. Remember, speaking up gets easier with practice.",
    "What happens if I feel sleepy during class?": "If you feel sleepy, try sitting up straight and taking a deep breath to wake yourself up a bit. At home, getting a good night’s sleep can help you feel more awake in school. If you’re feeling too tired, let your teacher know.",
    "What if I don’t know how to do something on my own?": "Learning to do new things on your own takes time. Your teachers are there to help if you get stuck, and it’s okay to ask a friend too. School is a place for learning, so you’re not expected to know everything right away!",
    "Will I still have time to play my favorite sports?": "Yes! Primary school has sports and games during PE classes and recess. You can also join after-school activities to keep doing the sports you love.",
    "What happens if I get sick at school?": "If you ever feel unwell, tell your teacher or an adult. They’ll take you to the school nurse, and if you need to go home, they will call your parents to come and get you.",
    "What if I forget where my classroom is?": "That’s perfectly okay! Primary school is big, and it takes time to remember all the places. You can ask a teacher or an older student, and they’ll be happy to show you the way.",
    "What do I do if my friends want to play a game I don’t like?": "You can let them know that you’d like to play something different or suggest a game that everyone enjoys. It’s okay to speak up about what you like too, and your friends will appreciate you sharing your ideas.",
    "What if I don’t know how to read or write as well as my classmates?": "Everyone learns at their own pace, and that’s okay! Your teacher will help you improve step-by-step. The important thing is to keep trying and asking questions whenever you need help.",
    "Will there be exams? What if I fail?": "There will be tests to help teachers understand what you’ve learned, but don’t worry too much about them. If you do your best and ask for help when you need it, you’ll do just fine. And if you don’t get the results you want, it’s a chance to learn and grow!",
    "What if I don’t like the activities we do?": "It’s normal not to enjoy every activity. You might find that trying new things is a good way to discover what you like. If there’s something you really don’t enjoy, you can talk to your teacher and let them know.",
    "What if I don’t like my uniform?": "Wearing a uniform can feel different at first, but it helps everyone feel like part of a big school family. Once you get used to it, it won’t seem so strange. Plus, you won’t have to worry about what to wear each day!",
    "What if I don’t get chosen to answer questions in class?": "Teachers try to give everyone a chance, but sometimes it can take time to get to everyone. Even if you’re not chosen, it’s good to keep thinking about the answers. Your time to share will come!",
    "What if other kids laugh at me if I make a mistake?": "Everyone makes mistakes while learning, and that’s perfectly okay. If someone laughs, it might just be their way of reacting, not to make you feel bad. Mistakes are how we learn, so keep trying and be proud of your efforts!",
    "What if I don’t understand the language my teacher is speaking?": "It’s okay if you don’t understand everything right away. Your teacher will repeat things and explain in different ways to help you. You can also ask a classmate or the teacher for help if you’re feeling lost.",
    "What if I have trouble opening my water bottle or lunch box?": "That’s okay! If you need help, you can ask a friend or a teacher nearby. There’s always someone around who can help with little things like that.",
    "Will there be time to rest during the school day?": "There are breaks between classes and a longer recess, where you can take a rest, have a snack, or just relax with your friends. Even teachers take breaks to recharge during the day!",
    "How will I know when it’s time to go home?": "Your school will have a bell or an announcement to let everyone know when the day is over. You’ll follow your class until you get used to the timing, and your teachers will help you find your way to the gate or bus.",
    "What if my pencil breaks or I lose my things?": "It’s okay if that happens! You can let your teacher know if you need something, or you can ask a friend to lend you what you need for the moment. Your teacher will help you learn how to keep track of your things.",
    "How will I remember everything I’m supposed to do?": "In the beginning, there’s a lot to remember, but it’s okay if you need reminders. Your teacher will give you tips, and you can use a little notebook to keep track of things. Over time, it will all feel more natural.",
    "What if I want to ask my teacher something but I’m scared?": "Your teachers are there to help, and they want you to feel comfortable. It’s okay to feel scared at first, but you can start by asking something small. Over time, you’ll feel more confident talking to them.",
    "How do I ask for help if I’m confused?": "If you’re confused, you can raise your hand or wait until your teacher is free to ask. It’s okay to say, ‘I don’t understand,’ or ‘Can you help me?’ Teachers are there to make sure you learn and feel comfortable.",
    "What if I don’t like waking up early?": "Waking up early can be tough, but it gives you more time to enjoy the day! You can go to bed a bit earlier, and maybe plan a special breakfast you like to make waking up something to look forward to.",
    "What if the other kids don’t like me?": "It’s natural to feel worried about this, but remember that everyone in your class is new too and looking to make friends. Just be yourself, smile, and be kind to others. You’ll find friends who like you for who you are.",
    "What if I get homesick and want to go home?": "Feeling homesick is normal when you’re somewhere new. You can bring a small reminder of home, like a little keychain or picture. If you’re feeling really sad, you can tell your teacher, and they’ll help you feel better.",
    "What if I forget my teacher’s name?": "It’s okay to forget at first! You can ask a friend or look at the class list if you’re unsure. Teachers understand and will remind you until you get used to it."
}
